DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="EMIOS_1">
      <name>EMIOS_2</name>
      <description>eMIOS</description>
      <groupName>eMIOS</groupName>
      <baseAddress>0x40090000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x31C</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>LCU_0</name>
      <description>LCU</description>
      <groupName>LCU</groupName>
      <headerStructName>LCU</headerStructName>
      <baseAddress>0x40098000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2AC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LCU0</name>
        <value>92</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>LC[%s]</name>
          <description>no description available</description>
          <addressOffset>0</addressOffset>
          <register>
            <dim>4</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2,3</dimIndex>
            <name>LC_LUTCTRL%s</name>
            <description>LC n Output m LUT Control</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LUTCTRL</name>
                <description>LUT Control</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>4</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2,3</dimIndex>
            <name>LC_FILT%s</name>
            <description>LC n Output m Filter</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LUT_FALL_FILT</name>
                <description>Fall Filter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>bypass</name>
                    <description>Bypass filter</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LUT_RISE_FILT</name>
                <description>Rise Filter</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>bypass</name>
                    <description>Bypass filter</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LC_INTDMAEN</name>
            <description>LC n Interrupt and DMA Enable</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LUT_INT_EN</name>
                <description>LUT Interrupt Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LUT_DMA_EN</name>
                <description>LUT DMA Enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_INT_EN</name>
                <description>Force Interrupt Enable</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_DMA_EN</name>
                <description>Force DMA Enable</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LC_STS</name>
            <description>LC n Status</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LUT_STS</name>
                <description>LUT Event</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>FORCESTS</name>
                <description>Force Event</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LC_OUTPOL</name>
            <description>LC n Output Polarity Control</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>OUTPOL</name>
                <description>Output Polarity</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LC_FFILT</name>
            <description>LC n Force Filter</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FORCE_FILT</name>
                <description>Force Filter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>bypass</name>
                    <description>Bypass filter</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCE_POL</name>
                <description>Force Input Polarity</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>COMB_EN</name>
                <description>Combinational Force Path (CFP) Enable</description>
                <bitOffset>24</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>COMB_FORCE</name>
                <description>Combined Sensed Force Input</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LC_FCTRL</name>
            <description>LC n Force Control</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FORCE_SENSE0</name>
                <description>Force Input Sensitivity</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_MODE0</name>
                <description>Force Clearing Mode</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>force_deassertion0</name>
                    <description>Deassertion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>rising_sync_after_force_deassertion0</name>
                    <description>Rising sync after deassertion</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>w1c_after_force_deassertion0</name>
                    <description>Writing 1 after deassertion</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>rising_sync_after_w1c_and_force_deassertion0</name>
                    <description>Rising sync after writing 1 and deassertion</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SYNC_SEL0</name>
                <description>Sync Select</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>input0</name>
                    <description>Sync input 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>input1</name>
                    <description>Sync input 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCE_SENSE1</name>
                <description>Force Input Sensitivity</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_MODE1</name>
                <description>Force Clearing Mode</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>force_deassertion1</name>
                    <description>Deassertion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>rising_sync_after_force_deassertion1</name>
                    <description>Rising sync after deassertion</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>w1c_after_force_deassertion1</name>
                    <description>Writing 1 after deassertion</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>rising_sync_after_w1c_and_force_deassertion1</name>
                    <description>Rising sync after writing 1 and deassertion</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SYNC_SEL1</name>
                <description>Sync Select</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>input0</name>
                    <description>Sync input 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>input1</name>
                    <description>Sync input 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCE_SENSE2</name>
                <description>Force Input Sensitivity</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_MODE2</name>
                <description>Force Clearing Mode</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>force_deassertion2</name>
                    <description>Deassertion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>rising_sync_after_force_deassertion2</name>
                    <description>Rising sync after deassertion</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>w1c_after_force_deassertion2</name>
                    <description>Writing 1 after deassertion</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>rising_sync_after_w1c_and_force_deassertion2</name>
                    <description>Rising sync after writing 1 and deassertion</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SYNC_SEL2</name>
                <description>Sync Select</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>input0</name>
                    <description>Sync input 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>input1</name>
                    <description>Sync input 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCE_SENSE3</name>
                <description>Force Input Sensitivity</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_MODE3</name>
                <description>Force Clearing Mode</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>force_deassertion3</name>
                    <description>Deassertion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>rising_sync_after_force_deassertion3</name>
                    <description>Rising sync after deassertion</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>w1c_after_force_deassertion3</name>
                    <description>Writing 1 after deassertion</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>rising_sync_after_w1c_and_force_deassertion3</name>
                    <description>Rising sync after writing 1 and deassertion</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SYNC_SEL3</name>
                <description>Sync Select</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>input0</name>
                    <description>Sync input 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>input1</name>
                    <description>Sync input 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LC_SCTRL</name>
            <description>LC n Sync Control</description>
            <addressOffset>0x34</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SW_MODE</name>
                <description>Software Sync Mode</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SW_SYNC_SEL</name>
                <description>Software Sync Select</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>input0</name>
                    <description>Sync input 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>input1</name>
                    <description>Sync input 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
