DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>CEOCFR1</name>
          <description>Channel End Of Conversion Flag For Standard Inputs</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIEOCF0</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF1</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF2</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF3</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF4</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF5</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF6</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF7</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF8</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF9</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF10</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF11</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF12</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF13</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF14</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF15</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF16</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF17</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF18</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF19</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF20</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF21</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF22</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCF23</name>
              <description>Standard Input End Of Conversion Flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
