DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
              <description>Low Analog Watchdog Interrupt Flag 13</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF13</name>
              <description>High Analog Watchdog Interrupt Flag 13</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF14</name>
              <description>Low Analog Watchdog Interrupt Flag 14</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF14</name>
              <description>High Analog Watchdog Interrupt Flag 14</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF15</name>
              <description>Low Analog Watchdog Interrupt Flag 15</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF15</name>
              <description>High Analog Watchdog Interrupt Flag 15</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF16</name>
              <description>Low Analog Watchdog Interrupt Flag 16</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF16</name>
              <description>High Analog Watchdog Interrupt Flag 16</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WTIMR</name>
          <description>Analog Watchdog Threshold Interrupt Enable</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LAWIFEN1</name>
              <description>Low Analog Watchdog Interrupt Flag Enable n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lwdgidis</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lwdgien</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HDWIFEN1</name>
              <description>High Data Watchdog Interrupt Flag Enable n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>hwdgidis</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hwdgien</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIFEN2</name>
              <description>Low Analog Watchdog Interrupt Flag Enable n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lwdgidis</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lwdgien</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HDWIFEN2</name>
              <description>High Data Watchdog Interrupt Flag Enable n</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>hwdgidis</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hwdgien</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIFEN3</name>
              <description>Low Analog Watchdog Interrupt Flag Enable n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lwdgidis</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lwdgien</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HDWIFEN3</name>
              <description>High Data Watchdog Interrupt Flag Enable n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>hwdgidis</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hwdgien</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIFEN4</name>
              <description>Low Analog Watchdog Interrupt Flag Enable n</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lwdgidis</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lwdgien</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HDWIFEN4</name>
              <description>High Data Watchdog Interrupt Flag Enable n</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>hwdgidis</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hwdgien</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAE</name>
          <description>Direct Memory Access Configuration</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAEN</name>
              <description>DMA Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dmadis</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmaen</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCLR</name>
              <description>DMA Clear Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ackclr</name>
                  <description>DMA controller acknowledges the request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ipsclr</name>
                  <description>Conversion data register is read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR0</name>
          <description>DMA Request Enable For Precision Inputs</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIDMAREN0</name>
              <description>Precision Input DMA Request Enable 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodmareq</name>
                  <description>Not triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmareqen</name>
                  <description>Triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDMAREN1</name>
              <description>Precision Input DMA Request Enable 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodmareq</name>
                  <description>Not triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmareqen</name>
                  <description>Triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDMAREN2</name>
              <description>Precision Input DMA Request Enable 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodmareq</name>
                  <description>Not triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmareqen</name>
                  <description>Triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDMAREN3</name>
              <description>Precision Input DMA Request Enable 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodmareq</name>
                  <description>Not triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmareqen</name>
                  <description>Triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDMAREN4</name>
              <description>Precision Input DMA Request Enable 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodmareq</name>
                  <description>Not triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmareqen</name>
                  <description>Triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDMAREN5</name>
              <description>Precision Input DMA Request Enable 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodmareq</name>
                  <description>Not triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmareqen</name>
                  <description>Triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDMAREN6</name>
              <description>Precision Input DMA Request Enable 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodmareq</name>
                  <description>Not triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmareqen</name>
                  <description>Triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDMAREN7</name>
              <description>Precision Input DMA Request Enable 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodmareq</name>
                  <description>Not triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmareqen</name>
                  <description>Triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
