DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>docon</name>
                  <description>Input n is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSDR</name>
          <description>Delay Start Of Data Conversion</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSD</name>
              <description>Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDEDR</name>
          <description>Power Down Exit Delay</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDED</name>
              <description>Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDR0</name>
          <description>Precision Input n Conversion Data</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Conversion Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT</name>
              <description>Conversion Data Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncd</name>
                  <description>Normal trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jcd</name>
                  <description>Injected trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bctucd</name>
                  <description>BCTU trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERW</name>
              <description>Overwrite Status Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noowr</name>
                  <description>No unread data is overwritten</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>owr</name>
                  <description>Unread data is overwritten</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Conversion Data Available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodata</name>
                  <description>No unread conversion data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dataav</name>
                  <description>Unread conversion data is available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDR1</name>
          <description>Precision Input n Conversion Data</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Conversion Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT</name>
              <description>Conversion Data Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncd</name>
                  <description>Normal trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jcd</name>
                  <description>Injected trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bctucd</name>
                  <description>BCTU trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERW</name>
              <description>Overwrite Status Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noowr</name>
                  <description>No unread data is overwritten</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>owr</name>
                  <description>Unread data is overwritten</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Conversion Data Available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodata</name>
                  <description>No unread conversion data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dataav</name>
                  <description>Unread conversion data is available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDR2</name>
          <description>Precision Input n Conversion Data</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Conversion Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT</name>
              <description>Conversion Data Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncd</name>
                  <description>Normal trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jcd</name>
                  <description>Injected trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bctucd</name>
                  <description>BCTU trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERW</name>
              <description>Overwrite Status Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noowr</name>
                  <description>No unread data is overwritten</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>owr</name>
                  <description>Unread data is overwritten</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Conversion Data Available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodata</name>
                  <description>No unread conversion data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dataav</name>
                  <description>Unread conversion data is available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDR3</name>
          <description>Precision Input n Conversion Data</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Conversion Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT</name>
              <description>Conversion Data Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncd</name>
                  <description>Normal trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jcd</name>
                  <description>Injected trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bctucd</name>
                  <description>BCTU trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERW</name>
              <description>Overwrite Status Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noowr</name>
                  <description>No unread data is overwritten</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>owr</name>
                  <description>Unread data is overwritten</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Conversion Data Available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodata</name>
                  <description>No unread conversion data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dataav</name>
                  <description>Unread conversion data is available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDR4</name>
          <description>Precision Input n Conversion Data</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Conversion Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT</name>
              <description>Conversion Data Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncd</name>
                  <description>Normal trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jcd</name>
                  <description>Injected trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bctucd</name>
                  <description>BCTU trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERW</name>
              <description>Overwrite Status Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noowr</name>
                  <description>No unread data is overwritten</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>owr</name>
                  <description>Unread data is overwritten</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Conversion Data Available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodata</name>
                  <description>No unread conversion data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dataav</name>
                  <description>Unread conversion data is available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDR5</name>
          <description>Precision Input n Conversion Data</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Conversion Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT</name>
              <description>Conversion Data Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncd</name>
                  <description>Normal trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jcd</name>
                  <description>Injected trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bctucd</name>
                  <description>BCTU trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERW</name>
              <description>Overwrite Status Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noowr</name>
                  <description>No unread data is overwritten</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>owr</name>
                  <description>Unread data is overwritten</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Conversion Data Available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodata</name>
                  <description>No unread conversion data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dataav</name>
                  <description>Unread conversion data is available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDR6</name>
          <description>Precision Input n Conversion Data</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Conversion Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT</name>
              <description>Conversion Data Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncd</name>
                  <description>Normal trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jcd</name>
                  <description>Injected trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bctucd</name>
                  <description>BCTU trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERW</name>
              <description>Overwrite Status Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noowr</name>
                  <description>No unread data is overwritten</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>owr</name>
                  <description>Unread data is overwritten</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Conversion Data Available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodata</name>
                  <description>No unread conversion data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dataav</name>
                  <description>Unread conversion data is available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
