DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>CWSELRSI0</name>
          <description>Channel Analog Watchdog Select For Standard Inputs</description>
          <addressOffset>0x2C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WSEL_SI0_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI1_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI2_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI3_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI4_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI5_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI6_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI7_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CWSELRSI1</name>
          <description>Channel Analog Watchdog Select For Standard Inputs</description>
          <addressOffset>0x2C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WSEL_SI0_1</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI1_1</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI2_1</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI3_1</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI4_1</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI5_1</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI6_1</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI7_1</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
