DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>MSR</name>
          <description>Main Status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCSTATUS</name>
              <description>ADC State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idle</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powerdown</name>
                  <description>Power Down</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wait</name>
                  <description>Wait</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>calibrate</name>
                  <description>Calibrate</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>convert</name>
                  <description>Convert</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>done</name>
                  <description>Done</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACKO</name>
              <description>Auto Clock-Off On</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ackooff</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ackoon</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHADDR</name>
              <description>Input Under Measure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>input_number</name>
                  <description>Input number</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>input_number</name>
                  <description>Input number</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>input_number</name>
                  <description>Input number</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>input_number</name>
                  <description>Input number</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>input_number</name>
                  <description>Input number</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>input_number</name>
                  <description>Input number</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>input_number</name>
                  <description>Input number</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>input_number</name>
                  <description>Input number</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>input_number</name>
                  <description>Input number</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>input_number</name>
                  <description>Input number</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCTUSTART</name>
              <description>BCTU Conversion Started</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ctuoff</name>
                  <description>Conversion was not triggered by BCTU</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cturunning</name>
                  <description>Ongoing conversion was triggered by BCTU</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELF_TEST_S</name>
              <description>Indicates whether an ongoing conversion is for self-test.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nost</name>
                  <description>Not self-test</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>strunning</name>
                  <description>Self-test</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JSTART</name>
              <description>Injected Conversion Started</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noj</name>
                  <description>Not an injected conversion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jrunning</name>
                  <description>Injected conversion</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JABORT</name>
              <description>Injected Conversion Aborted</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nojabort</name>
                  <description>Not aborted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jaborted</name>
                  <description>Aborted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSTART</name>
              <description>Normal Conversion Started</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>non</name>
                  <description>Not in progress</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nrunning</name>
                  <description>In progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALIBRTD</name>
              <description>Calibration Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nocal</name>
                  <description>Uncalibrated or calibration unsuccessful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cal</name>
                  <description>Calibrated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ECH</name>
              <description>End Of Chain Conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>ECH_NO</name>
                  <description>Indicates no ECH interrupt generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECH_YES</name>
                  <description>Indicates an ECH interrupt has been generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOC</name>
              <description>End Of Conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>EOC_NO</name>
                  <description>No EOC interrupt generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOC_YES</name>
                  <description>Interrupt generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JECH</name>
              <description>End Of Injected Chain Conversion</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>JECH_NO</name>
                  <description>No JECH interrupt generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JECH_YES</name>
                  <description>JECH interrupt generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JEOC</name>
              <description>End Of Injected Conversion</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>JEOC_NO</name>
                  <description>No JEOC interrupt generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JEOC_YES</name>
                  <description>JEOC interrupt generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOBCTU</name>
              <description>End Of BCTU Conversion</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>EOBCTU_NO</name>
                  <description>No EOBCTU interrupt generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOBCTU_YES</name>
                  <description>EOBCTU interrupt generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CEOCFR0</name>
          <description>Channel End Of Conversion Flag For Precision Inputs</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIEOCF0</name>
              <description>Precision Input End Of Conversion Flag 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCF1</name>
              <description>Precision Input End Of Conversion Flag 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCF2</name>
              <description>Precision Input End Of Conversion Flag 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCF3</name>
              <description>Precision Input End Of Conversion Flag 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCF4</name>
              <description>Precision Input End Of Conversion Flag 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCF5</name>
              <description>Precision Input End Of Conversion Flag 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCF6</name>
              <description>Precision Input End Of Conversion Flag 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCF7</name>
              <description>Precision Input End Of Conversion Flag 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>COMPLETE_NO</name>
                  <description>Conversion not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE_YES</name>
                  <description>Conversion complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
