DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>IMR</name>
          <description>Interrupt Mask</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSKECH</name>
              <description>ECH Interrupt Flag Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>maskechi</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enechi</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKEOC</name>
              <description>EOC Interrupt Flag Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>maskeoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>eneoci</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKJECH</name>
              <description>JECH Interrupt Flag Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>maskjechi</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enjechi</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKJEOC</name>
              <description>JEOC Interrupt Flag Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>maskjeoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enjeoci</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKEOBCTU</name>
              <description>EOBCTU Interrupt Flag Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>maskebctui</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>eneobctui</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIMR0</name>
          <description>EOC Interrupt Enable For Precision Inputs</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIEOCIEN0</name>
              <description>Precision Input EOC Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nopieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCIEN1</name>
              <description>Precision Input EOC Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nopieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCIEN2</name>
              <description>Precision Input EOC Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nopieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCIEN3</name>
              <description>Precision Input EOC Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nopieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCIEN4</name>
              <description>Precision Input EOC Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nopieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCIEN5</name>
              <description>Precision Input EOC Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nopieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCIEN6</name>
              <description>Precision Input EOC Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nopieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIEOCIEN7</name>
              <description>Precision Input EOC Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nopieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
