DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>IAHBCFGREG</name>
          <description>AHB Gasket Configuration</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EMAC_DIS_WR_OPT</name>
              <description>Determines whether write burst optimizations in the EMAC AHB gasket are enabled or disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DIS_WR_OPT_0</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DIS_WR_OPT_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_AXBS_S0_DIS_WR_OPT</name>
              <description>Determines whether write burst optimizations in the DMA AXBS S0 AHB gasket are enabled or disabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_AXBS_S0_DIS_WR_OPT_0</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_AXBS_S0_DIS_WR_OPT_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_AXBS_S1_DIS_WR_OPT</name>
              <description>Determines whether write burst optimizations in the DMA AXBS S1 AHB gasket are enabled or disabled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_AXBS_S1_DIS_WR_OPT_0</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_AXBS_S1_DIS_WR_OPT_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_DIS_WR_OPT</name>
              <description>Determines whether write burst optimizations in the HSE AHB gasket are enabled or disabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE_DIS_WR_OPT_0</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIS_WR_OPT_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCM_DIS_WR_OPT</name>
              <description>Determines whether write burst optimizations in the TCM AHB gasket are enabled or disabled</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCM_DIS_WR_OPT_0</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM_DIS_WR_OPT_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QSPI_DIS_WR_OPT</name>
              <description>Determines whether write burst optimizations in the QuadSPI AHB gasket are enabled or disabled</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QSPI_DIS_WR_OPT_0</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QSPI_DIS_WR_OPT_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIPS1_DIS_WR_OPT</name>
              <description>Determines whether write burst optimizations in the AIPS1 AHB gasket are enabled or disabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIPS1_DIS_WR_OPT_0</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIPS1_DIS_WR_OPT_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIPS2_DIS_WR_OPT</name>
              <description>Determines whether write burst optimizations in the AIPS2 AHB gasket are enabled or disabled</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIPS2_DIS_WR_OPT_0</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIPS2_DIS_WR_OPT_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>240</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>IRSPRC[%s]</name>
          <description>Interrupt Router Shared Peripheral Routing Control</description>
          <addressOffset>0x880</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>M7_0</name>
              <description>Enable Cortex-M7_0 Interrupt Steering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_0_0</name>
                  <description>Routing disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_0_1</name>
                  <description>Routing enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_0</name>
                  <description>Writes to IRSPRCn allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_1</name>
                  <description>Writes to IRSPRCn ignored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
