DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>HWCFG2</name>
          <description>Hardware Configuration 2</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIDP0</name>
              <description>Process Identifier Present</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP1</name>
              <description>Process Identifier Present</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP2</name>
              <description>Process Identifier Present</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP3</name>
              <description>Process Identifier Present</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP4</name>
              <description>Process Identifier Present</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP5</name>
              <description>Process Identifier Present</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP6</name>
              <description>Process Identifier Present</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP7</name>
              <description>Process Identifier Present</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP8</name>
              <description>Process Identifier Present</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP9</name>
              <description>Process Identifier Present</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP10</name>
              <description>Process Identifier Present</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP11</name>
              <description>Process Identifier Present</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP12</name>
              <description>Process Identifier Present</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP13</name>
              <description>Process Identifier Present</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP14</name>
              <description>Process Identifier Present</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP15</name>
              <description>Process Identifier Present</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP16</name>
              <description>Process Identifier Present</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP17</name>
              <description>Process Identifier Present</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP18</name>
              <description>Process Identifier Present</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP19</name>
              <description>Process Identifier Present</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP20</name>
              <description>Process Identifier Present</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP21</name>
              <description>Process Identifier Present</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP22</name>
              <description>Process Identifier Present</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP23</name>
              <description>Process Identifier Present</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP24</name>
              <description>Process Identifier Present</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP25</name>
              <description>Process Identifier Present</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP26</name>
              <description>Process Identifier Present</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP27</name>
              <description>Process Identifier Present</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP28</name>
              <description>Process Identifier Present</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP29</name>
              <description>Process Identifier Present</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP30</name>
              <description>Process Identifier Present</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDP31</name>
              <description>Process Identifier Present</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
