DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
                  <name>NOBMSOURCE</name>
                  <description>Does not have PID register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BMSOURCE</name>
                  <description>Has PID register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDACFG0</name>
          <description>Master Domain Assignment Configuration</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number Of Master Domain Assignment Registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Master does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCM</name>
              <description>Noncore Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROC</name>
                  <description>Core master or master does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONPROC</name>
                  <description>Noncore master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDACFG1</name>
          <description>Master Domain Assignment Configuration</description>
          <addressOffset>0x101</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x81</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number Of Master Domain Assignment Registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Master does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCM</name>
              <description>Noncore Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROC</name>
                  <description>Core master or master does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONPROC</name>
                  <description>Noncore master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDACFG2</name>
          <description>Master Domain Assignment Configuration</description>
          <addressOffset>0x102</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x81</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number Of Master Domain Assignment Registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Master does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCM</name>
              <description>Noncore Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROC</name>
                  <description>Core master or master does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONPROC</name>
                  <description>Noncore master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDACFG3</name>
          <description>Master Domain Assignment Configuration</description>
          <addressOffset>0x103</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number Of Master Domain Assignment Registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Master does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCM</name>
              <description>Noncore Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROC</name>
                  <description>Core master or master does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONPROC</name>
                  <description>Noncore master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDACFG5</name>
          <description>Master Domain Assignment Configuration</description>
          <addressOffset>0x105</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x81</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number Of Master Domain Assignment Registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Master does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER</name>
                  <description>Number of registers</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCM</name>
              <description>Noncore Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROC</name>
                  <description>Core master or master does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONPROC</name>
                  <description>Noncore master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCFG0</name>
          <description>Memory Region Configuration</description>
          <addressOffset>0x140</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMRGD</name>
              <description>Number Of Memory Region Descriptors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>MRC does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWELVE</name>
                  <description>12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <description>16</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCFG1</name>
          <description>Memory Region Configuration</description>
          <addressOffset>0x141</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMRGD</name>
              <description>Number Of Memory Region Descriptors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>MRC does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWELVE</name>
                  <description>12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <description>16</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCFG2</name>
          <description>Memory Region Configuration</description>
          <addressOffset>0x142</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMRGD</name>
              <description>Number Of Memory Region Descriptors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>MRC does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWELVE</name>
                  <description>12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <description>16</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DERRLOC[%s]</name>
          <description>Domain Error Location</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MRCINST</name>
              <description>MRC Instance</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PACINST</name>
              <description>PAC Instance</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DERR_W0_0</name>
          <description>Domain Error Word 0</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
