DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MC_RGM</name>
      <description>MC_RGM</description>
      <groupName>MC_RGM</groupName>
      <baseAddress>0x4028C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RGM</name>
        <value>51</value>
      </interrupt>
      <registers>
        <register>
          <name>DES</name>
          <description>Destructive Event Status Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>F_POR</name>
              <description>Flag for power-on reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_POWER_ON</name>
                  <description>No power-on event has occurred since the last clear.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_ON</name>
                  <description>A power-on event has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_FTR</name>
              <description>Flag for 'Destructive' Reset FCCU_FTR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event FCCU_FTR has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event FCCU_FTR has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STCU_URF</name>
              <description>Flag for 'Destructive' Reset STCU_URF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event STCU_URF has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event STCU_URF has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MC_RGM_FRE</name>
              <description>Flag for 'Destructive' Reset MC_RGM_FRE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event MC_RGM_FRE has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event MC_RGM_FRE has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FXOSC_FAIL</name>
              <description>Flag for 'Destructive' Reset FXOSC_FAIL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event FXOSC_FAIL has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event FXOSC_FAIL has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_LOL</name>
              <description>Flag for 'Destructive' Reset PLL_LOL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event PLL_LOL has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event PLL_LOL has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CORE_CLK_FAIL</name>
              <description>Flag for 'Destructive' Reset CORE_CLK_FAIL</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event CORE_CLK_FAIL has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event CORE_CLK_FAIL has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIPS_PLAT_CLK_FAIL</name>
              <description>Flag for 'Destructive' Reset AIPS_PLAT_CLK_FAIL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event AIPS_PLAT_CLK_FAIL has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event AIPS_PLAT_CLK_FAIL has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_CLK_FAIL</name>
              <description>Flag for 'Destructive' Reset HSE_CLK_FAIL</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event HSE_CLK_FAIL has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event HSE_CLK_FAIL has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYS_DIV_FAIL</name>
              <description>Flag for 'Destructive' Reset SYS_DIV_FAIL</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event SYS_DIV_FAIL has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event SYS_DIV_FAIL has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_TMPR_RST</name>
              <description>Flag for 'Destructive' Reset HSE_TMPR_RST</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event HSE_TMPR_RST has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event HSE_TMPR_RST has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_SNVS_RST</name>
              <description>Flag for 'Destructive' Reset HSE_SNVS_RST</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event HSE_SNVS_RST has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event HSE_SNVS_RST has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_DEST</name>
              <description>Flag for 'Destructive' Reset SW_DEST</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event SW_DEST has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event SW_DEST has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG_DEST</name>
              <description>Flag for 'Destructive' Reset DEBUG_DEST</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>'Destructive' reset event DEBUG_DEST has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>'Destructive' reset event DEBUG_DEST has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FES</name>
          <description>Functional /External Reset Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>F_EXR</name>
              <description>Flag for External Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXT_RESET</name>
                  <description>No external reset event has occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_RESET</name>
                  <description>An external reset event has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_RST</name>
              <description>Flag for 'Functional' Reset FCCU_RST</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FUNC_RESET</name>
                  <description>'Functional' reset event FCCU_RST has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNC_RESET</name>
                  <description>'Functional' reset event FCCU_RST has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ST_DONE</name>
              <description>Flag for 'Functional' Reset ST_DONE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FUNC_RESET</name>
                  <description>'Functional' reset event ST_DONE has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNC_RESET</name>
                  <description>'Functional' reset event ST_DONE has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT0_RST</name>
              <description>Flag for 'Functional' Reset SWT0_RST</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FUNC_RESET</name>
                  <description>'Functional' reset event SWT0_RST has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNC_RESET</name>
                  <description>'Functional' reset event SWT0_RST has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JTAG_RST</name>
              <description>Flag for 'Functional' Reset JTAG_RST</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FUNC_RESET</name>
                  <description>'Functional' reset event JTAG_RST has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNC_RESET</name>
                  <description>'Functional' reset event JTAG_RST has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_SWT_RST</name>
              <description>Flag for 'Functional' Reset HSE_SWT_RST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FUNC_RESET</name>
                  <description>'Functional' reset event HSE_SWT_RST has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNC_RESET</name>
                  <description>'Functional' reset event HSE_SWT_RST has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_BOOT_RST</name>
              <description>Flag for 'Functional' Reset HSE_BOOT_RST</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FUNC_RESET</name>
                  <description>'Functional' reset event HSE_BOOT_RST has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNC_RESET</name>
                  <description>'Functional' reset event HSE_BOOT_RST has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_FUNC</name>
              <description>Flag for 'Functional' Reset SW_FUNC</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FUNC_RESET</name>
                  <description>'Functional' reset event SW_FUNC has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNC_RESET</name>
                  <description>'Functional' reset event SW_FUNC has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG_FUNC</name>
              <description>Flag for 'Functional' Reset DEBUG_FUNC</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FUNC_RESET</name>
                  <description>'Functional' reset event DEBUG_FUNC has not occurred since either the last clear or the last power-on reset assertion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNC_RESET</name>
                  <description>'Functional' reset event DEBUG_FUNC has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
