DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>FERD</name>
          <description>Functional Event Reset Disable Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-writeOnce</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D_FCCU_RST</name>
              <description>FCCU_RST Disable Control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Functional reset event FCCU_RST triggers a reset sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Functional reset event FCCU_RST generates an interrupt request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D_SWT0_RST</name>
              <description>SWT0_RST Disable Control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Functional reset event SWT0_RST triggers a reset sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Functional reset event SWT0_RST generates an interrupt request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D_JTAG_RST</name>
              <description>JTAG_RST Disable Control</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Functional reset event JTAG_RST triggers a reset sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Functional reset event JTAG_RST generates an interrupt request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D_DEBUG_FUNC</name>
              <description>DEBUG_FUNC Disable Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Functional reset event DEBUG_FUNC triggers a reset sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Functional reset event DEBUG_FUNC generates an interrupt request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FBRE</name>
          <description>Functional Bidirectional Reset Enable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BE_FCCU_RST</name>
              <description>Bidirectional Reset Enables for 'Functional' Reset FCCU_RST</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_PIN_ASSERTED</name>
                  <description>External reset pin is asserted on a 'Functional' reset FCCU_RST event if the reset is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_PIN_NOT_ASSERTED</name>
                  <description>External reset pin is not asserted on a 'functional' reset FCCU_RST event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BE_ST_DONE</name>
              <description>Bidirectional Reset Enables for 'Functional' Reset ST_DONE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_PIN_ASSERTED</name>
                  <description>External reset pin is asserted on a 'Functional' reset ST_DONE event if the reset is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_PIN_NOT_ASSERTED</name>
                  <description>External reset pin is not asserted on a 'functional' reset ST_DONE event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BE_SWT0_RST</name>
              <description>Bidirectional Reset Enables for 'Functional' Reset SWT0_RST</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_PIN_ASSERTED</name>
                  <description>External reset pin is asserted on a 'Functional' reset SWT0_RST event if the reset is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_PIN_NOT_ASSERTED</name>
                  <description>External reset pin is not asserted on a 'functional' reset SWT0_RST event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BE_JTAG_RST</name>
              <description>Bidirectional Reset Enables for 'Functional' Reset JTAG_RST</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_PIN_ASSERTED</name>
                  <description>External reset pin is asserted on a 'Functional' reset JTAG_RST event if the reset is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_PIN_NOT_ASSERTED</name>
                  <description>External reset pin is not asserted on a 'functional' reset JTAG_RST event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BE_HSE_SWT_RST</name>
              <description>Bidirectional Reset Enables for 'Functional' Reset HSE_SWT_RST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_PIN_ASSERTED</name>
                  <description>External reset pin is asserted on a 'Functional' reset HSE_SWT_RST event if the reset is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_PIN_NOT_ASSERTED</name>
                  <description>External reset pin is not asserted on a 'functional' reset HSE_SWT_RST event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BE_HSE_BOOT_RST</name>
              <description>Bidirectional Reset Enables for 'Functional' Reset HSE_BOOT_RST</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_PIN_ASSERTED</name>
                  <description>External reset pin is asserted on a 'Functional' reset HSE_BOOT_RST event if the reset is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_PIN_NOT_ASSERTED</name>
                  <description>External reset pin is not asserted on a 'functional' reset HSE_BOOT_RST event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BE_SW_FUNC</name>
              <description>Bidirectional Reset Enables for 'Functional' Reset SW_FUNC</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_PIN_ASSERTED</name>
                  <description>External reset pin is asserted on a 'Functional' reset SW_FUNC event if the reset is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_PIN_NOT_ASSERTED</name>
                  <description>External reset pin is not asserted on a 'functional' reset SW_FUNC event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BE_DEBUG_FUNC</name>
              <description>Bidirectional Reset Enables for 'Functional' Reset DEBUG_FUNC</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_PIN_ASSERTED</name>
                  <description>External reset pin is asserted on a 'Functional' reset DEBUG_FUNC event if the reset is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_PIN_NOT_ASSERTED</name>
                  <description>External reset pin is not asserted on a 'functional' reset DEBUG_FUNC event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FREC</name>
          <description>Functional Reset Escalation Counter Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREC</name>
              <description>Functional' Reset Escalation Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRET</name>
          <description>Functional Reset Escalation Threshold Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRET</name>
              <description>'Functional' Reset Escalation Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRET</name>
          <description>Destructive Reset Escalation Threshold Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DRET</name>
              <description>'Destructive' Reset Escalation Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERCTRL</name>
          <description>External Reset Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERASSERT</name>
              <description>ERASSERT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CHANGE</name>
                  <description>No change</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_RESET_ASSERTED</name>
                  <description>External reset is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RDSS</name>
          <description>Reset During Standby Status Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DES_RES</name>
              <description>DES_RES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DEST_RESET</name>
                  <description>No destructive reset event occurred during standby mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RESET</name>
                  <description>Destructive reset event occurred during standby mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FES_RES</name>
              <description>FES_RES</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FUNC_RESET</name>
                  <description>No functional reset event occurred during standby mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUNC_RESET</name>
                  <description>Functional reset event occurred during standby mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRENTC</name>
          <description>Functional Reset Entry Timeout Control Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRET_EN</name>
              <description>Functional Reset Entry Timer Enable/Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Functional reset entry timer is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Functional reset entry timer is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRET_TIMEOUT</name>
              <description>Functional Reset Entry Timer Value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPDEBUG</name>
          <description>Low Power Debug Control Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LP_DBG_EN</name>
              <description>Low-Power Debug Enable/Disable Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Low-power debug disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Debug data collection enabled before entering low-power debug</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
