DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>GPDO56</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x133B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO63</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x133C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO62</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x133D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO61</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x133E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO60</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x133F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO67</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x1340</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO66</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x1341</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO65</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x1342</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO64</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x1343</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO71</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x1344</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO70</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x1345</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO69</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x1346</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO68</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x1347</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO75</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x1348</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO74</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x1349</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO73</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x134A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO72</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x134B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO79</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x134C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO78</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x134D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO77</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x134E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDO76</name>
          <description>SIUL2 GPIO Pad Data Output Register</description>
          <addressOffset>0x134F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDO_n</name>
              <description>Pad Data Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_a_LOW</name>
                  <description>Pad Data Out Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_a_HIGH</name>
                  <description>Pad Data Out High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
