DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>GPDI31</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x151C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI30</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x151D</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI29</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x151E</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI28</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x151F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI35</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1520</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI34</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1521</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI33</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1522</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI32</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1523</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI37</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1526</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI36</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1527</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI43</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1528</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI42</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1529</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI41</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x152A</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI40</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x152B</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI47</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x152C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI46</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x152D</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI45</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x152E</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI44</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x152F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI51</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1530</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI50</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1531</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI49</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1532</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
