DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>DCMLCS</name>
          <description>LC Scan Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCMLCSS1</name>
              <description>MCU_PROD Scan Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCSS1_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCSS1_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCC1</name>
              <description>MCU_PROD Marking</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCC1_0</name>
                  <description>Not scanned yet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC1_1</name>
                  <description>Marked as active</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC1_2</name>
                  <description>Marked as inactive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC1_3</name>
                  <description>Region is erased/virgin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC1_5</name>
                  <description>Marked as inactive by an unknown pattern</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC1_6</name>
                  <description>Scanning timed out</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCE1</name>
              <description>MCU_PROD ECC Errors</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCE1_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCE1_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCFE1</name>
              <description>MCU_PROD Flash Memory Error Check</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCFE1_0</name>
                  <description>Successful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCFE1_1</name>
                  <description>Failed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCSS2</name>
              <description>CUST_DEL Scan Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCSS2_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCSS2_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCC2</name>
              <description>CUST_DEL Marking</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCC2_0</name>
                  <description>Not scanned yet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC2_1</name>
                  <description>Marked as active</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC2_2</name>
                  <description>Marked as inactive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC2_3</name>
                  <description>Region is erased/virgin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC2_5</name>
                  <description>Marked as inactive by an unknown pattern</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC2_6</name>
                  <description>Scanning timed out</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCE2</name>
              <description>ECC Errors In CUST_DEL</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCE2_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCE2_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCFE2</name>
              <description>CUST_DEL Flash Memory Error Check</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCFE2_0</name>
                  <description>Successful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCFE2_1</name>
                  <description>Failed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCSS3</name>
              <description>OEM_PROD Scan Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCSS3_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCSS3_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCC3</name>
              <description>OEM_PROD Marking</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCC3_0</name>
                  <description>Not scanned yet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC3_1</name>
                  <description>Marked as active</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC3_2</name>
                  <description>Marked as inactive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC3_3</name>
                  <description>Region is erased/virgin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC3_5</name>
                  <description>Marked as inactive by an unknown pattern</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC3_6</name>
                  <description>Scanning timed out</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCE3</name>
              <description>OEM_PROD ECC Errors</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCE3_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCE3_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCFE3</name>
              <description>OEM_PROD Flash Memory Error Check</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCFE3_0</name>
                  <description>Successful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCFE3_1</name>
                  <description>Failed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCSS4</name>
              <description>IN_FIELD Scan Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCSS4_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCSS4_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCC4</name>
              <description>IN_FIELD Marking Status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCC4_0</name>
                  <description>Not scanned yet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC4_1</name>
                  <description>Marked as active</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC4_2</name>
                  <description>Marked as inactive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC4_3</name>
                  <description>Region is erased/virgin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC4_5</name>
                  <description>Marked as inactive by an unknown pattern</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC4_6</name>
                  <description>Scanning timed out</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCE4</name>
              <description>IN_FIELD ECC Errors</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCE4_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCE4_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCFE4</name>
              <description>IN_FIELD Flash Memory Error Check</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCFE4_0</name>
                  <description>Successful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCFE4_1</name>
                  <description>Failed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCSS5</name>
              <description>Pre-FA Scan Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCSS5_0</name>
                  <description>Successful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCSS5_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCC5</name>
              <description>Pre-FA Marking Status</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCC5_0</name>
                  <description>Not scanned yet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC5_1</name>
                  <description>Marked as active</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC5_2</name>
                  <description>Marked as inactive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC5_3</name>
                  <description>Region is erased/virgin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC5_5</name>
                  <description>Marked as inactive by an unknown pattern</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC5_6</name>
                  <description>Scanning timed out</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCE5</name>
              <description>Pre-FA ECC Errors</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCE5_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCE5_1</name>
                  <description>Marking error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCFE5</name>
              <description>Pre-FA Flash Memory Error Check</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCFE5_0</name>
                  <description>Successful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCFE5_1</name>
                  <description>Failed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMMISC</name>
          <description>DCM Miscellaneous</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCMDBGT</name>
              <description>DBG Section Error</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMDBGT_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMDBGT_1</name>
                  <description>Error exists</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMDBGE</name>
              <description>DCM ECC error on DBG sections</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMDBGE_0</name>
                  <description>No error on DBG section</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMDBGE_1</name>
                  <description>DBG section error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMCERS</name>
              <description>DCF Client Errors</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMCERS_0</name>
                  <description>No errors on any of the DCF clients</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMCERS_1</name>
                  <description>Atleast one safety DCF client has an error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
