DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>DCMDEB</name>
          <description>Debug Status and Configuration</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCM_APPDBG_STAT</name>
              <description>DCM Authentication Engine Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCM_APPDBG_STAT_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCM_APPDBG_STAT_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPDBG_STAT_SOC</name>
              <description>Application Debug Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APPDBG_STAT_SOC_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APPDBG_STAT_SOC_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMEC</name>
          <description>DCF Error Count</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCMECT</name>
              <description>Error Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16</dimIndex>
          <name>DCMSRR%s</name>
          <description>DCF Scan Report</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCMDCFE1</name>
              <description>Flash Memory Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DCMDCFF1</name>
              <description>DCF Record Location</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMDCFF1_2</name>
                  <description>Utest region</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMDCFF1_5</name>
                  <description>Others: Reserved</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMESF1</name>
              <description>Flash Memory Error</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMESF1_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMESF1_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMESD1</name>
              <description>Chip Side Error</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMESD1_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMESD1_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMDCFT1</name>
              <description>Scanning Timeout On Flash Memory</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMDCFT1_0</name>
                  <description>Does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMDCFT1_1</name>
                  <description>Exists</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMLCS_2</name>
          <description>LC Scan Status 2</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCMLCSS6</name>
              <description>FA Scan Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCSS6_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCSS6_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCC6</name>
              <description>FA Marking</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCC6_0</name>
                  <description>Not scanned yet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC6_1</name>
                  <description>Marked as active</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC6_2</name>
                  <description>Marked as inactive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC6_3</name>
                  <description>Region is erased/virgin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC6_5</name>
                  <description>Marked as inactive by an unknown pattern</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCC6_6</name>
                  <description>Scanning timed out</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCE6</name>
              <description>FA ECC Errors</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCE6_0</name>
                  <description>No errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCE6_1</name>
                  <description>Errors exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCFE6</name>
              <description>Flash Memory Error Check</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCFE6_0</name>
                  <description>Successful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCFE6_1</name>
                  <description>Failed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
