DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_DCTAG_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Multi bit ECC error from CM7_0 DCache tag memory</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_DCTAG_ECC_ERR_EN_0</name>
                  <description>No multi-bit ECC error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_DCTAG_ECC_ERR_EN_1</name>
                  <description>Multi-bit ECC error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_ICDATA_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Multi bit ECC error from CM7_0 ICache data memory</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_ICDATA_ECC_ERR_EN_0</name>
                  <description>No multi-bit ECC error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_ICDATA_ECC_ERR_EN_1</name>
                  <description>Multi-bit ECC error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWD4</name>
          <description>Read Write GPR On Destructive Reset Register</description>
          <addressOffset>0x50C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xEF7FFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CM7_0_ICTAG_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Multi bit ECC error from CM7_0 ICache tag memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_ICTAG_ECC_ERR_EN_0</name>
                  <description>No multi-bit ECC error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_ICTAG_ECC_ERR_EN_1</name>
                  <description>Multi-bit ECC error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_ITCM_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Uncorrectable ECC error from CM7_0 Instruction TCM memory</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_ITCM_ECC_ERR_EN_0</name>
                  <description>Uncorrectable ECC error detection at FCCU not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_ITCM_ECC_ERR_EN_1</name>
                  <description>Uncorrectable ECC error detection enabled at FCCU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_DTCM0_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Uncorrectable ECC error from CM7_0 Data TCM memory block 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_DTCM0_ECC_ERR_EN_0</name>
                  <description>Uncorrectable ECC error detection at FCCU not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_DTCM0_ECC_ERR_EN_1</name>
                  <description>Uncorrectable ECC error detection enabled at FCCU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_DTCM1_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Uncorrectable ECC error from CM7_0 Data TCM memory block 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_DTCM1_ECC_ERR_EN_0</name>
                  <description>Uncorrectable ECC error detection at FCCU not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_DTCM1_ECC_ERR_EN_1</name>
                  <description>Uncorrectable ECC error detection enabled at FCCU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_1_ITCM_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Uncorrectable ECC error from CM7_1 Instruction TCM memory</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_1_ITCM_ECC_ERR_EN_0</name>
                  <description>Uncorrectable ECC error detection at FCCU not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_1_ITCM_ECC_ERR_EN_1</name>
                  <description>Uncorrectable ECC error detection enabled at FCCU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_1_DTCM0_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Uncorrectable ECC error from CM7_1 Data TCM memory block 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_1_DTCM0_ECC_ERR_EN_0</name>
                  <description>Uncorrectable ECC error detection at FCCU not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_1_DTCM0_ECC_ERR_EN_1</name>
                  <description>Uncorrectable ECC error detection enabled at FCCU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_1_DTCM1_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Uncorrectable ECC error from CM7_1 Data TCM memory block 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_1_DTCM1_ECC_ERR_EN_0</name>
                  <description>Uncorrectable ECC error detection at FCCU not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_1_DTCM1_ECC_ERR_EN_1</name>
                  <description>Uncorrectable ECC error detection enabled at FCCU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_TCD_RAM_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Uncorrectable ECC error reported from DMA_TCD memory</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_TCD_RAM_ECC_ERR_EN_0</name>
                  <description>Uncorrectable ECC error detection at FCCU not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_TCD_RAM_ECC_ERR_EN_1</name>
                  <description>Uncorrectable ECC error detection enabled at FCCU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRAM0_FCCU_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: PRAM0 safety alarm</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRAM0_FCCU_ALARM_EN_0</name>
                  <description>No safety alarm indicated by PRAM0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRAM0_FCCU_ALARM_EN_1</name>
                  <description>Safety alarm indicated by PRAM0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRAM1_FCCU_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: PRAM1 safety alarm</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRAM1_FCCU_ALARM_EN_0</name>
                  <description>No safety alarm indicated by PRAM1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRAM1_FCCU_ALARM_EN_1</name>
                  <description>Safety alarm indicated by PRAM1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_RAM_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: HSE RAM Uncorrectable ECC</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE_RAM_ECC_ERR_EN_0</name>
                  <description>No uncorrectable ECC reported by HSE RAM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_RAM_ECC_ERR_EN_1</name>
                  <description>Uncorrectable ECC reported by HSE RAM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PF0_CODE_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 3 for the fault: Flash0 code ECC uncorrectable error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PF0_CODE_ECC_ERR_EN_0</name>
                  <description>No uncorrectable error reported in flash controller port 0 code memory by FMU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PF0_CODE_ECC_ERR_EN_1</name>
                  <description>Uncorrectable error reported in flash controller port 0 code memory by FMU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PF0_DATA_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 3 for the fault: Flash0 data ECC uncorrectable error</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PF0_DATA_ECC_ERR_EN_0</name>
                  <description>No uncorrectable error reported in flash controller port 0 data memory by FMU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PF0_DATA_ECC_ERR_EN_1</name>
                  <description>Uncorrectable error reported in flash controller port 0 data memory by FMU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PF1_CODE_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 3 for the fault: Flash1 code ECC uncorrectable error</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PF1_CODE_ECC_ERR_EN_0</name>
                  <description>No uncorrectable error reported in flash controller port 1 code memory by FMU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PF1_CODE_ECC_ERR_EN_1</name>
                  <description>Uncorrectable error reported in flash controller port 1 code memory by FMU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PF1_DATA_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 3 for the fault: Flash1 data ECC uncorrectable error</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PF1_DATA_ECC_ERR_EN_0</name>
                  <description>No uncorrectable error reported in flash controller port 1 data memory by FMU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PF1_DATA_ECC_ERR_EN_1</name>
                  <description>Uncorrectable error reported in flash controller port 1 data memory by FMU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_EDC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 3 for the fault: Flash ECC correction error through EDC reported by FMU</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_EDC_ERR_EN_0</name>
                  <description>No EDC after ECC error reported in flash.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_EDC_ERR_EN_1</name>
                  <description>EDC after ECC error reported in flash.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ADDR_ENC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 3 for the fault: Flash address encode error</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ADDR_ENC_ERR_EN_0</name>
                  <description>No address encode error in flash.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ADDR_ENC_ERR_EN_1</name>
                  <description>Address encode error in flash.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_REF_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 3 for the fault: Flash reference current loss or read voltage error while prevoius read(s)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_REF_ERR_EN_0</name>
                  <description>No reference current loss or read voltage error while previous reads(s).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_REF_ERR_EN_1</name>
                  <description>Reference current loss or read voltage error while previous read(s).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_RST_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 3 for the fault: Flash reset error</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_RST_ERR_EN_0</name>
                  <description>No flash reset error indicated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_RST_ERR_EN_1</name>
                  <description>Flash reset error indicated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_SCAN_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 3 for the fault: Error while DCM flash scanning process due to invalid data</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_SCAN_ERR_EN_0</name>
                  <description>No error while DCM flash scanning.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_SCAN_ERR_EN_1</name>
                  <description>Error while DCM flash scanning.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ACCESS_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 3 for the fault: Transaction monitor mismatch error from flash controller</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ACCESS_ERR_EN_0</name>
                  <description>No transaction monitor mismatch error from flash controller.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ACCESS_ERR_EN_1</name>
                  <description>Transaction monitor mismatch error from flash controller.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD1P1_GNG_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 4 for the fault: Go/Nogo indicator for VDD1PD1 (double bond) supply going to PLL</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD1P1_GNG_ERR_EN_0</name>
                  <description>Go indication referring to the supply being clean.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD1P1_GNG_ERR_EN_1</name>
                  <description>No go indication referring to the supply being unclean and a fault in double bond connection or its routing within the chip.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD2P5_GNG_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 4 for the fault: Go/Nogo for VDD_HV_FLA (double bond) going to FXOSC and PLL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD2P5_GNG_ERR_EN_0</name>
                  <description>Go indication referring to the supply being clean.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD2P5_GNG_ERR_EN_1</name>
