DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>DCMRWD6</name>
          <description>Read Write GPR On Destructive Reset Register</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDMA_DBG_DIS_CM7_0</name>
              <description>EDMA debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDMA_DBG_DIS_CM7_0_0</name>
                  <description>EDMA enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDMA_DBG_DIS_CM7_0_1</name>
                  <description>EDMA remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_DBG_DIS_CM7_0</name>
              <description>FCCU debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCCU_DBG_DIS_CM7_0_0</name>
                  <description>FCCU enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCU_DBG_DIS_CM7_0_1</name>
                  <description>FCCU remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCU0_DBG_DIS_CM7_0</name>
              <description>LCU0 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCU0_DBG_DIS_CM7_0_0</name>
                  <description>LCU0 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCU0_DBG_DIS_CM7_0_1</name>
                  <description>LCU0 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCU1_DBG_DIS_CM7_0</name>
              <description>LCU1 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCU1_DBG_DIS_CM7_0_0</name>
                  <description>LCU1 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCU1_DBG_DIS_CM7_0_1</name>
                  <description>LCU1 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMIOS0_DBG_DIS_CM7_0</name>
              <description>EMIOS0 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMIOS0_DBG_DIS_CM7_0_0</name>
                  <description>eMIOS0 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMIOS0_DBG_DIS_CM7_0_1</name>
                  <description>eMIOS0 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMIOS1_DBG_DIS_CM7_0</name>
              <description>EMIOS1 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMIOS1_DBG_DIS_CM7_0_0</name>
                  <description>eMIOS1 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMIOS1_DBG_DIS_CM7_0_1</name>
                  <description>eMIOS1 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMIOS2_DBG_DIS_CM7_0</name>
              <description>EMIOS2 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMIOS2_DBG_DIS_CM7_0_0</name>
                  <description>eMIOS2 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMIOS2_DBG_DIS_CM7_0_1</name>
                  <description>eMIOS2 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC_DBG_DIS_CM7_0</name>
              <description>RTC debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTC_DBG_DIS_CM7_0_0</name>
                  <description>RTC enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_DBG_DIS_CM7_0_1</name>
                  <description>RTC remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT0_DBG_DIS_CM7_0</name>
              <description>SWT0 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT0_DBG_DIS_CM7_0_0</name>
                  <description>SWT0 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT0_DBG_DIS_CM7_0_1</name>
                  <description>SWT0 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT1_DBG_DIS_CM7_0</name>
              <description>SWT1 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT1_DBG_DIS_CM7_0_0</name>
                  <description>SWT0 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT1_DBG_DIS_CM7_0_1</name>
                  <description>SWT0 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STM0_DBG_DIS_CM7_0</name>
              <description>STM0 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STM0_DBG_DIS_CM7_0_0</name>
                  <description>STM0 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STM0_DBG_DIS_CM7_0_1</name>
                  <description>STM0 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STM1_DBG_DIS_CM7_0</name>
              <description>STM1 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STM1_DBG_DIS_CM7_0_0</name>
                  <description>STM1 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STM1_DBG_DIS_CM7_0_1</name>
                  <description>STM1 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIT0_DBG_DIS_CM7_0</name>
              <description>PIT0 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIT0_DBG_DIS_CM7_0_0</name>
                  <description>PIT0 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT0_DBG_DIS_CM7_0_1</name>
                  <description>PIT0 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIT1_DBG_DIS_CM7_0</name>
              <description>PIT1 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIT1_DBG_DIS_CM7_0_0</name>
                  <description>PIT1 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT1_DBG_DIS_CM7_0_1</name>
                  <description>PIT1 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIT2_DBG_DIS_CM7_0</name>
              <description>PIT2 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIT2_DBG_DIS_CM7_0_0</name>
                  <description>PIT2 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT2_DBG_DIS_CM7_0_1</name>
                  <description>PIT2 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI0_DBG_DIS_CM7_0</name>
              <description>LPSPI0 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI0_DBG_DIS_CM7_0_0</name>
                  <description>LPSPI0 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI0_DBG_DIS_CM7_0_1</name>
                  <description>LPSPI0 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI1_DBG_DIS_CM7_0</name>
              <description>LPSPI1 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI1_DBG_DIS_CM7_0_0</name>
                  <description>LPSPI1 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI1_DBG_DIS_CM7_0_1</name>
                  <description>LPSPI1 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI2_DBG_DIS_CM7_0</name>
              <description>LPSPI2 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI2_DBG_DIS_CM7_0_0</name>
                  <description>LPSPI2 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI2_DBG_DIS_CM7_0_1</name>
                  <description>LPSPI2 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI3_DBG_DIS_CM7_0</name>
              <description>LPSPI3 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI3_DBG_DIS_CM7_0_0</name>
                  <description>LPSPI3 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI3_DBG_DIS_CM7_0_1</name>
                  <description>LPSPI3 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI4_DBG_DIS_CM7_0</name>
              <description>LPSPI4 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI4_DBG_DIS_CM7_0_0</name>
                  <description>LPSPI4 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI4_DBG_DIS_CM7_0_1</name>
                  <description>LPSPI4 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI5_DBG_DIS_CM7_0</name>
              <description>LPSPI5 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI5_DBG_DIS_CM7_0_0</name>
                  <description>LPSPI5 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI5_DBG_DIS_CM7_0_1</name>
                  <description>LPSPI5 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C0_DBG_DIS_CM7_0</name>
              <description>LPI2C0 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C0_DBG_DIS_CM7_0_0</name>
                  <description>LPI2C0 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C0_DBG_DIS_CM7_0_1</name>
                  <description>LPI2C0 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C1_DBG_DIS_CM7_0</name>
              <description>LPI2C1 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C1_DBG_DIS_CM7_0_0</name>
                  <description>LPI2C1 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C1_DBG_DIS_CM7_0_1</name>
                  <description>LPI2C1 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO_DBG_DIS_CM7_0</name>
              <description>FLEXIO debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO_DBG_DIS_CM7_0_0</name>
                  <description>FLEXIO enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO_DBG_DIS_CM7_0_1</name>
                  <description>FLEXIO remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN0_DBG_DIS_CM7_0</name>
              <description>FLEXCAN0 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN0_DBG_DIS_CM7_0_0</name>
                  <description>FLEXCAN0 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN0_DBG_DIS_CM7_0_1</name>
                  <description>FLEXCAN0 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN1_DBG_DIS_CM7_0</name>
              <description>FLEXCAN1 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN1_DBG_DIS_CM7_0_0</name>
