DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>DCMRWF2</name>
          <description>Read Write GPR On Functional Reset Register</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCM_SCAN_BYP_STDBY_EXT</name>
              <description>Control to bypass the DCM scanning on standby exit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCM_SCAN_BYP_STDBY_EXT_0</name>
                  <description>Not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCM_SCAN_BYP_STDBY_EXT_1</name>
                  <description>Bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRC_TRIM_BYP_STDBY_EXT</name>
              <description>Control to bypass the FIRC trimming on standby exit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRC_TRIM_BYP_STDBY_EXT_0</name>
                  <description>Not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRC_TRIM_BYP_STDBY_EXT_1</name>
                  <description>Bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMC_TRIM_RGM_DCF__BYP_STDBY_EXT</name>
              <description>Control to bypass the PMC trimming and RGM DCF loading on standby exit.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMC_TRIM_RGM_DCF__BYP_STDBY_EXT_0</name>
                  <description>Not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMC_TRIM_RGM_DCF__BYP_STDBY_EXT_1</name>
                  <description>Bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRC_TRIM_BYP_STDBY_EXT</name>
              <description>Control to bypass the SIRC trimming on standby exit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRC_TRIM_BYP_STDBY_EXT_0</name>
                  <description>Not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRC_TRIM_BYP_STDBY_EXT_1</name>
                  <description>Bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_GSKT_BYPASS</name>
              <description>Control to enable the HSE IAHB gasket behavior out of standby mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE_GSKT_BYPASS_0</name>
                  <description>When configured as 0, HSE IAHB gasket bypass configuration is controlled by DCF client.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_GSKT_BYPASS_1</name>
                  <description>When configured as 1, HSE IAHB gasket is bypassed out of standby.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWF4</name>
          <description>Read Write GPR On Functional Reset Register</description>
          <addressOffset>0x60C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE_EN_ADC0_S8</name>
              <description>Selects the GPIO45 to drive ADC0 standard channel 8th.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC0_S8_0</name>
                  <description>Selects the default PAD 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC0_S8_1</name>
                  <description>Selects the PAD mentioned in description.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC0_S9</name>
              <description>Selects the GPIO46 to drive ADC0 standard channel 9th.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC0_S9_0</name>
                  <description>Selects the default PAD 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC0_S9_1</name>
                  <description>Selects the PAD mentioned in description.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC1_S14</name>
              <description>Selects the GPIO32 to drive ADC1 standard channel 14th.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S14_0</name>
                  <description>Selects the default PAD 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S14_1</name>
                  <description>Selects the PAD mentioned in description.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC1_S15</name>
              <description>Selects the GPIO33 to drive ADC1 standard channel 15th.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S15_0</name>
                  <description>Selects the default PAD 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S15_1</name>
                  <description>Selects the PAD mentioned in description.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC1_S22</name>
              <description>Selects the GPIO114 to drive ADC1 standard channel 22nd.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S22_0</name>
                  <description>Selects the default PAD 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S22_1</name>
                  <description>Selects the PAD mentioned in description.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC1_S23</name>
              <description>Selects the GPIO115 to drive ADC1 standard channel 23rd.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S23_0</name>
                  <description>Selects the default PAD 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S23_1</name>
                  <description>Selects the PAD mentioned in description.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC2_S8</name>
              <description>Selects the GPIO45 to drive adc2 standard channel 8th.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC2_S8_0</name>
                  <description>Selects the default PAD 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC2_S8_1</name>
                  <description>Selects the PAD mentioned in description.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC2_S9</name>
              <description>Selects the GPIO46 to drive adc2 standard channel 9th.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC2_S9_0</name>
                  <description>Selects the default PAD 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC2_S9_1</name>
                  <description>Selects the PAD mentioned in description.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLITCH_FIL_TRG_IN0_BYP</name>
              <description>Selects whether to BYPASS or filter out the pulse.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN0_BYP_0</name>
                  <description>Glitch filter on TRGMUX input63 is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN0_BYP_1</name>
                  <description>Glitch filter on TRGMUX input63 is bypassed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLITCH_FIL_TRG_IN1_BYP</name>
              <description>Selects whether to BYPASS or filter out the pulse.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN1_BYP_0</name>
                  <description>Glitch filter on TRGMUX input62 is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN1_BYP_1</name>
                  <description>Glitch filter on TRGMUX input62 is bypassed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLITCH_FIL_TRG_IN2_BYP</name>
              <description>Selects whether to BYPASS or filter out the pulse.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN2_BYP_0</name>
                  <description>Glitch filter on TRGMUX input61 is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN2_BYP_1</name>
                  <description>Glitch filter on TRGMUX input61 is bypassed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLITCH_FIL_TRG_IN3_BYP</name>
              <description>Selects whether to BYPASS or filter out the pulse.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN3_BYP_0</name>
                  <description>Glitch filter on TRGMUX input60 is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN3_BYP_1</name>
                  <description>Glitch filter on TRGMUX input60 is bypassed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_CPUWAIT</name>
              <description>Configuration to put CM7_0 core into wait mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_CPUWAIT_0</name>
                  <description>CPUWAIT for CM7_0 disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_CPUWAIT_1</name>
                  <description>CM7_0 put into wait mode using CPUWAIT.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWF5</name>
          <description>Read Write GPR On Functional Reset Register</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>BOOT_MODE</name>
              <description>Selects the boot mode after exiting Standby mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOT_MODE_0</name>
                  <description>Normal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT_MODE_1</name>
                  <description>Fast Standby</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_ADDRESS</name>
              <description>Cortex-M7_0 base address of vector table to be used after exiting Standby mode (only to be considered in Fast Standby mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
