DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>DCMROPP2</name>
          <description>Read Only GPR On PMCPOR Reset</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POR_WDG_STAT32</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT32_0</name>
                  <description>MC_RGM.RGM_FES[0] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT32_1</name>
                  <description>MC_RGM.RGM_FES[0] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT33</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT33_0</name>
                  <description>MC_RGM.RGM_FES[1] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT33_1</name>
                  <description>MC_RGM.RGM_FES[1] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT34</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT34_0</name>
                  <description>MC_RGM.RGM_FES[2] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT34_1</name>
                  <description>MC_RGM.RGM_FES[2] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT35</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT35_0</name>
                  <description>MC_RGM.RGM_FES[3] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT35_1</name>
                  <description>MC_RGM.RGM_FES[3] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT36</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT36_0</name>
                  <description>MC_RGM.RGM_FES[4] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT36_1</name>
                  <description>MC_RGM.RGM_FES[4] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT37</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT37_0</name>
                  <description>MC_RGM.RGM_FES[5] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT37_1</name>
                  <description>MC_RGM.RGM_FES[5] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT38</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT38_0</name>
                  <description>MC_RGM.RGM_FES[6] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT38_1</name>
                  <description>MC_RGM.RGM_FES[6] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT39</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT39_0</name>
                  <description>MC_RGM.RGM_FES[7] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT39_1</name>
                  <description>MC_RGM.RGM_FES[7] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT40</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT40_0</name>
                  <description>MC_RGM.RGM_FES[8] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT40_1</name>
                  <description>MC_RGM.RGM_FES[8] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT41</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT41_0</name>
                  <description>MC_RGM.RGM_FES[9] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT41_1</name>
                  <description>MC_RGM.RGM_FES[9] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT42</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT42_0</name>
                  <description>MC_RGM.RGM_FES[10] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT42_1</name>
                  <description>MC_RGM.RGM_FES[10] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT43</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT43_0</name>
                  <description>MC_RGM.RGM_FES[11] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT43_1</name>
                  <description>MC_RGM.RGM_FES[11] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT44</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT44_0</name>
                  <description>MC_RGM.RGM_FES[12] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT44_1</name>
                  <description>MC_RGM.RGM_FES[12] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT45</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT45_0</name>
                  <description>MC_RGM.RGM_FES[13] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT45_1</name>
                  <description>MC_RGM.RGM_FES[13] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT46</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT46_0</name>
                  <description>MC_RGM.RGM_FES[14] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT46_1</name>
                  <description>MC_RGM.RGM_FES[14] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT47</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT47_0</name>
                  <description>MC_RGM.RGM_FES[15] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT47_1</name>
                  <description>MC_RGM.RGM_FES[15] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT48</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT48_0</name>
                  <description>MC_RGM.RGM_FES[16] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT48_1</name>
                  <description>MC_RGM.RGM_FES[16] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT49</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT49_0</name>
                  <description>MC_RGM.RGM_FES[17] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT49_1</name>
                  <description>MC_RGM.RGM_FES[17] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT50</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT50_0</name>
                  <description>MC_RGM.RGM_FES[18] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT50_1</name>
                  <description>MC_RGM.RGM_FES[18] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT51</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT51_0</name>
                  <description>MC_RGM.RGM_FES[19] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT51_1</name>
                  <description>MC_RGM.RGM_FES[19] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT52</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT52_0</name>
                  <description>MC_RGM.RGM_FES[20] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT52_1</name>
                  <description>MC_RGM.RGM_FES[20] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT53</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT53_0</name>
                  <description>MC_RGM.RGM_FES[21] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT53_1</name>
                  <description>MC_RGM.RGM_FES[21] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT54</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT54_0</name>
                  <description>MC_RGM.RGM_FES[22] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT54_1</name>
                  <description>MC_RGM.RGM_FES[22] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT55</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT55_0</name>
                  <description>MC_RGM.RGM_FES[23] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT55_1</name>
                  <description>MC_RGM.RGM_FES[23] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT56</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT56_0</name>
                  <description>MC_RGM.RGM_FES[24] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
