DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT56_1</name>
                  <description>MC_RGM.RGM_FES[24] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT57</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT57_0</name>
                  <description>MC_RGM.RGM_FES[25] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT57_1</name>
                  <description>MC_RGM.RGM_FES[25] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT58</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT58_0</name>
                  <description>MC_RGM.RGM_FES[26] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT58_1</name>
                  <description>MC_RGM.RGM_FES[26] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT59</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT59_0</name>
                  <description>MC_RGM.RGM_FES[27] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT59_1</name>
                  <description>MC_RGM.RGM_FES[27] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT60</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT60_0</name>
                  <description>MC_RGM.RGM_FES[28] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT60_1</name>
                  <description>MC_RGM.RGM_FES[28] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT61</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT61_0</name>
                  <description>MC_RGM.RGM_FES[29] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT61_1</name>
                  <description>MC_RGM.RGM_FES[29] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT62</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT62_0</name>
                  <description>MC_RGM.RGM_FES[30] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT62_1</name>
                  <description>MC_RGM.RGM_FES[30] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT63</name>
              <description>This bit captures MC_RGM functional/external event status register when POR_WDG overflows.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT63_0</name>
                  <description>MC_RGM.RGM_FES[31] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT63_1</name>
                  <description>MC_RGM.RGM_FES[31] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
