DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
              </enumeratedValues>
            </field>
            <field>
              <name>OBE23</name>
              <description>Output Buffer Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE23_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE23_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE24</name>
              <description>Output Buffer Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE24_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE24_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE25</name>
              <description>Output Buffer Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE25_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE25_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE26</name>
              <description>Output Buffer Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE26_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE26_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE27</name>
              <description>Output Buffer Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE27_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE27_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE28</name>
              <description>Output Buffer Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE28_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE28_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE29</name>
              <description>Output Buffer Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE29_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE29_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE30</name>
              <description>Output Buffer Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE30_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE30_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE31</name>
              <description>Output Buffer Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE31_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE31_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP1_OBE2</name>
          <description>Group OBE</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OBE32</name>
              <description>Output Buffer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE32_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE32_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE33</name>
              <description>Output Buffer Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE33_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE33_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE34</name>
              <description>Output Buffer Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE34_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE34_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE35</name>
              <description>Output Buffer Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE35_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE35_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE36</name>
              <description>Output Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE36_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE36_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE37</name>
              <description>Output Buffer Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE37_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE37_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE38</name>
              <description>Output Buffer Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE38_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE38_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE39</name>
              <description>Output Buffer Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE39_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE39_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE40</name>
              <description>Output Buffer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE40_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE40_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE41</name>
              <description>Output Buffer Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE41_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE41_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE42</name>
              <description>Output Buffer Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE42_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE42_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE43</name>
              <description>Output Buffer Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE43_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE43_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE44</name>
              <description>Output Buffer Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE44_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE44_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE45</name>
              <description>Output Buffer Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE45_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE45_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
