DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE26</name>
              <description>Output Buffer Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE26_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE26_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE27</name>
              <description>Output Buffer Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE27_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE27_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE28</name>
              <description>Output Buffer Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE28_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE28_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE29</name>
              <description>Output Buffer Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE29_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE29_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE30</name>
              <description>Output Buffer Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE30_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE30_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE31</name>
              <description>Output Buffer Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE31_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE31_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP2_OBE2</name>
          <description>Group OBE</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OBE32</name>
              <description>Output Buffer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE32_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE32_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE33</name>
              <description>Output Buffer Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE33_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE33_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE34</name>
              <description>Output Buffer Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE34_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE34_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE35</name>
              <description>Output Buffer Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE35_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE35_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE36</name>
              <description>Output Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE36_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE36_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE37</name>
              <description>Output Buffer Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE37_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE37_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
