DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>MUX_8_CSC</name>
          <description>Clock Mux 8 Select Control Register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_SW</name>
              <description>Clock switch</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAFE_SW</name>
              <description>Safe clock request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELCTL</name>
              <description>Clock source selection control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_src_0</name>
                  <description>FIRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_24</name>
                  <description>EMAC_RMII_TX_CLK</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_8_CSS</name>
          <description>Clock Mux 8 Select Status Register</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x80000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_SW</name>
              <description>Clock switch</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK</name>
                  <description>No clock switch operation was requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>Clock switch operation was requested.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAFE_SW</name>
              <description>Safe clock request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK</name>
                  <description>No safe clock switch operation was requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>Safe clock switch operation was requested.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWIP</name>
              <description>Switch in progress</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPETE</name>
                  <description>Clock source switching is complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN_PROGRESS</name>
                  <description>Clock source switching is in progress.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWTRG</name>
              <description>Switch trigger cause</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUCCESS</name>
                  <description>Switch after request succeeded.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAIL_TARGET_CLOCK</name>
                  <description>Switch after the request failed because of an inactive target clock and the current clock is FIRC.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAIL_CURRENT_CLOCK</name>
                  <description>Switch after the request failed because of an inactive current clock and the current clock is FIRC.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_SUCCEED</name>
                  <description>Switch to FIRC because of a safe clock request or reset succeeded.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_SUCCEED_INACTIVE</name>
                  <description>Switch to FIRC because of a safe clock request or reset succeeded, but the previous current clock source was inactive.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELSTAT</name>
              <description>Clock source selection status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_src_0</name>
                  <description>FIRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_24</name>
                  <description>EMAC_RMII_TX_CLK</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_8_DC_0</name>
          <description>Clock Mux 8 Divider 0 Control Register</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Division value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DE</name>
              <description>Divider enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Divider is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Divider is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_8_DIV_UPD_STAT</name>
          <description>Clock Mux 8 Divider Update Status Register</description>
          <addressOffset>0x53C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_STAT</name>
              <description>Divider status for clock mux 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIV_PENDING</name>
                  <description>No divider configuration update is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_PENDING</name>
                  <description>Divider configuration update on at least one divider associated with this multiplexer is pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_9_CSC</name>
          <description>Clock Mux 9 Select Control Register</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_SW</name>
              <description>Clock switch</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAFE_SW</name>
              <description>Safe clock request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELCTL</name>
              <description>Clock source selection control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_src_0</name>
                  <description>FIRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_2</name>
                  <description>FXOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_8</name>
                  <description>PLL_PHI0_CLK</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_24</name>
                  <description>EMAC_RMII_TX_CLK</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_25</name>
                  <description>EMAC_RX_CLK</description>
                  <value>0x19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_9_CSS</name>
          <description>Clock Mux 9 Select Status Register</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x80000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_SW</name>
              <description>Clock switch</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK</name>
                  <description>No clock switch operation was requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>Clock switch operation was requested.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAFE_SW</name>
              <description>Safe clock request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK</name>
                  <description>No safe clock switch operation was requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>Safe clock switch operation was requested.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWIP</name>
              <description>Switch in progress</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPETE</name>
                  <description>Clock source switching is complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN_PROGRESS</name>
                  <description>Clock source switching is in progress.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWTRG</name>
              <description>Switch trigger cause</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUCCESS</name>
                  <description>Switch after request succeeded.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAIL_TARGET_CLOCK</name>
                  <description>Switch after the request failed because of an inactive target clock and the current clock is FIRC.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAIL_CURRENT_CLOCK</name>
                  <description>Switch after the request failed because of an inactive current clock and the current clock is FIRC.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_SUCCEED</name>
                  <description>Switch to FIRC because of a safe clock request or reset succeeded.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_SUCCEED_INACTIVE</name>
                  <description>Switch to FIRC because of a safe clock request or reset succeeded, but the previous current clock source was inactive.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELSTAT</name>
              <description>Clock source selection status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_src_0</name>
                  <description>FIRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_2</name>
                  <description>FXOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_8</name>
                  <description>PLL_PHI0_CLK</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_24</name>
                  <description>EMAC_RMII_TX_CLK</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_25</name>
                  <description>EMAC_RX_CLK</description>
                  <value>0x19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_9_DC_0</name>
          <description>Clock Mux 9 Divider 0 Control Register</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Division value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DE</name>
              <description>Divider enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Divider is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Divider is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_9_DIV_UPD_STAT</name>
          <description>Clock Mux 9 Divider Update Status Register</description>
          <addressOffset>0x57C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_STAT</name>
              <description>Divider status for clock mux 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIV_PENDING</name>
                  <description>No divider configuration update is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_PENDING</name>
                  <description>Divider configuration update on at least one divider associated with this multiplexer is pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_10_CSC</name>
          <description>Clock Mux 10 Select Control Register</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_SW</name>
              <description>Clock switch</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAFE_SW</name>
              <description>Safe clock request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELCTL</name>
              <description>Clock source selection control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_src_0</name>
                  <description>FIRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_2</name>
                  <description>FXOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_9</name>
                  <description>PLL_PHI1_CLK</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
