DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>c40asf flash memory</description>
      <groupName>FLASH</groupName>
      <baseAddress>0x402EC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x180</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLASH_0</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>FLASH_1</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>FLASH_2</name>
        <value>50</value>
      </interrupt>
      <registers>
        <register>
          <name>MCR</name>
          <description>Module Configuration</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EHV</name>
              <description>Enable High Voltage</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EHV_0</name>
                  <description>Flash memory is not enabled to perform a high voltage operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EHV_1</name>
                  <description>Flash memory is enabled to perform a high voltage operation.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERS</name>
              <description>Erase</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERS_0</name>
                  <description>Flash memory not executing an erase sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERS_1</name>
                  <description>Flash memory executing an erase sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESS</name>
              <description>Erase Size Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ESS_0</name>
                  <description>Flash memory erase is on a sector</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESS_1</name>
                  <description>Flash memory erase is on a block</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGM</name>
              <description>Program</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PGM_0</name>
                  <description>Flash memory not executing a program sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGM_1</name>
                  <description>Flash memory executing a program sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDIE</name>
              <description>Watch Dog Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDIE_0</name>
                  <description>Watchdog interrupt not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDIE_1</name>
                  <description>Watchdog interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PECIE</name>
              <description>Program/Erase Complete Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PECIE_0</name>
                  <description>Interrupt request not generated when MCRS[DONE] is 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PECIE_1</name>
                  <description>Interrupt request generated when MCRS[DONE] is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEID</name>
              <description>Program and Erase Master/Domain ID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCRS</name>
          <description>Module Configuration Status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RE</name>
              <description>Reset Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RE_0</name>
                  <description>Reset occurred without errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RE_1</name>
                  <description>Reset error encountered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSPELOCK</name>
              <description>UTest NVM Program and Erase Lock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSPELOCK_0</name>
                  <description>Corresponding sector not locked, and may be programmed or erased</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSPELOCK_1</name>
                  <description>Corresponding sector protected from the program and erase sequences</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPEG</name>
              <description>ECC Enabled Program/Erase Good</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPEG_0</name>
                  <description>Program or erase operation did not require ECC Enabled verifies.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPEG_1</name>
                  <description>Program or erase operation required ECC Enabled verifies to pass.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDI</name>
              <description>Watch Dog Interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDI_0</name>
                  <description>Normal Operation, Watchdog Timer has not expired.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDI_1</name>
                  <description>Program Watchdog Timer has expired.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEG</name>
              <description>Program/Erase Good</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEG_0</name>
                  <description>Program or erase operation failed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEG_1</name>
                  <description>Program or erase operation successful</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DONE</name>
              <description>State Machine Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONE_0</name>
                  <description>Performing a high voltage operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONE_1</name>
                  <description>Not executing a high voltage operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PES</name>
              <description>Program and Erase Sequence Error</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PES_0</name>
                  <description>Program and erase sequence errors do not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PES_1</name>
                  <description>Previous program or erase sequence encountered an error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEP</name>
              <description>Program and Erase Protection Error</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEP_0</name>
                  <description>Program and erase protection errors do not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEP_1</name>
                  <description>Previous program or erase protection error encountered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWE</name>
              <description>Read-While-Write Event Error</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWE_0</name>
                  <description>Reads occur normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWE_1</name>
                  <description>RWW error occurred during a previous read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRE</name>
              <description>Read Reference Error</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RRE_0</name>
                  <description>Reads occur without reference issues</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RRE_1</name>
                  <description>Previous read may be corrupted because of read reference being out of range</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RVE</name>
              <description>Read Voltage Error</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RVE_0</name>
                  <description>Reads are occurring without voltage issues</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RVE_1</name>
                  <description>A previous read may have been corrupted due to read voltage being out of range</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EEE</name>
              <description>EDC after ECC Error</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EEE_0</name>
                  <description>Reads are occurring without EDC after ECC mismatches</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEE_1</name>
                  <description>Previous read may be corrupted based on ECC calculation errors</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AEE</name>
              <description>Address Encode Error</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AEE_0</name>
                  <description>Reads are occurring without address encode mismatches</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AEE_1</name>
                  <description>Previous read may be corrupted based on address encode mismatch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBC</name>
              <description>Single Bit Correction</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SBC_0</name>
                  <description>Reads occurring without corrections</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SBC_1</name>
                  <description>Single bit correction occurred during a previous read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EER</name>
              <description>ECC Event Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EER_0</name>
                  <description>Reads occurring normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EER_1</name>
                  <description>ECC error occurred during a previous read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCRE</name>
          <description>Extended Module Configuration</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>n256K</name>
              <description>Number of 256 KB Blocks</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>n256K_0</name>
                  <description>Zero 256 KB blocks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n256K_1</name>
                  <description>One 256 KB block</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n256K_2</name>
                  <description>Two 256 KB blocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n256K_3</name>
                  <description>Four 256 KB blocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>n512K</name>
              <description>Number of 512 KB Blocks</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>n512K_0</name>
                  <description>Zero 512 KB blocks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n512K_1</name>
                  <description>One 512 KB block</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n512K_2</name>
                  <description>Two 512 KB blocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n512K_3</name>
                  <description>Four 512 KB blocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>n1M</name>
              <description>Number of 1 MB Blocks</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>n1M_0</name>
                  <description>Zero 1 MB blocks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n1M_1</name>
                  <description>One 1 MB block</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n1M_2</name>
                  <description>Two 1 MB blocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n1M_3</name>
                  <description>Three 1 MB blocks</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n1M_4</name>
                  <description>Four 1 MB blocks</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
