DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>XMCR</name>
          <description>Express Module Configuration</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFC000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XEHV</name>
              <description>Express Enable High Voltage</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XEHV_0</name>
                  <description>Flash memory is not enabled to perform an express high voltage operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XEHV_1</name>
                  <description>Flash memory is enabled to perform an express high voltage operation.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XPGM</name>
              <description>Express Program</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XPGM_0</name>
                  <description>Flash memory not executing an express program sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XPGM_1</name>
                  <description>Flash memory executing an express program sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XEPEG</name>
              <description>Express ECC Enabled Program Good</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XEPEG_0</name>
                  <description>Program operation did not require ECC-enabled verifies</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XEPEG_1</name>
                  <description>Program operation required ECC-enabled verifies to pass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XWDIE</name>
              <description>Express Watch Dog Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XWDIE_0</name>
                  <description>Express watchdog interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XWDIE_1</name>
                  <description>Express watchdog interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XWDI</name>
              <description>Express Watch Dog Interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XWDI_0</name>
                  <description>Normal Operation, Watchdog Timer has not expired.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XWDI_1</name>
                  <description>Express Program Watchdog Timer has expired.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XDOK</name>
              <description>Express Data OK</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XDOK_0</name>
                  <description>Flash memory not ready to accept writes to the DATA registers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XDOK_1</name>
                  <description>Writes to DATA registers allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XPEG</name>
              <description>Express Program Good</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XPEG_0</name>
                  <description>Program operation failed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XPEG_1</name>
                  <description>Program operation successful</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XDONE</name>
              <description>Express State Machine Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XDONE_0</name>
                  <description>Executing an express program operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XDONE_1</name>
                  <description>Not executing an express program operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XPEID</name>
              <description>Express Program Master/Domain ID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XPEADR</name>
          <description>Express Program Address</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XPEADDR</name>
              <description>Express Program Address</description>
              <bitOffset>5</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XPEA0</name>
              <description>Express Program Address Region 0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XPEA0_0</name>
                  <description>Address accessed is not from region 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XPEA0_1</name>
                  <description>Address accessed is from region 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XPEA1</name>
              <description>Express Program Address Region 1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XPEA1_0</name>
                  <description>Address accessed is not from region 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XPEA1_1</name>
                  <description>Address accessed is from region 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XPEA2</name>
              <description>Express Program Address Region 2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XPEA2_0</name>
                  <description>Address accessed is not from region 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XPEA2_1</name>
                  <description>Address accessed is from region 2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XPEA3</name>
              <description>Express Program Address Region 3</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XPEA3_0</name>
                  <description>Address accessed is not from region 3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XPEA3_1</name>
                  <description>Address accessed is from region 3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XPEA4</name>
              <description>Express Program Address Region 4</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XPEA4_0</name>
                  <description>Address accessed is not from region 4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XPEA4_1</name>
                  <description>Address accessed is from region 4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XPEA5</name>
              <description>Express Program Address Region 5</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XPEA5_0</name>
                  <description>Address accessed is not from region 5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XPEA5_1</name>
                  <description>Address accessed is from region 5</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DATA[%s]</name>
          <description>Program Data</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDATA</name>
              <description>Program Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
