DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_1</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x4032C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART1</name>
        <value>142</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_2</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x40330000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART2</name>
        <value>143</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_3</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x40334000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART3</name>
        <value>144</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_4</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x40338000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART4</name>
        <value>145</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_5</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x4033C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART5</name>
        <value>146</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_6</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x40340000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART6</name>
        <value>147</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_7</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x40344000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART7</name>
        <value>148</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_8</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x4048C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART8</name>
        <value>149</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_9</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x40490000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART9</name>
        <value>150</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_10</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x40494000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART10</name>
        <value>151</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_11</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x40498000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART11</name>
        <value>152</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_12</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x4049C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART12</name>
        <value>153</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_13</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x404A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART13</name>
        <value>154</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART_0">
      <name>LPUART_14</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x404A4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART14</name>
        <value>155</value>
      </interrupt>
    </peripheral>
