DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LPCMP_0</name>
      <description>LPCMP</description>
      <groupName>LPCMP</groupName>
      <headerStructName>LPCMP</headerStructName>
      <baseAddress>0x40370000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPCMP0</name>
        <value>183</value>
      </interrupt>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROUND_ROBIN</name>
                  <description>Round robin feature</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAC_RES</name>
              <description>DAC Resolution</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESO_4</name>
                  <description>4 bit DAC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESO_6</name>
                  <description>6 bit DAC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESO_8</name>
                  <description>8 bit DAC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESO_10</name>
                  <description>10 bit DAC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESO_12</name>
                  <description>12 bit DAC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESO_14</name>
                  <description>14 bit DAC</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESO_16</name>
                  <description>16 bit DAC</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR0</name>
          <description>Comparator Control Register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP_EN</name>
              <description>Comparator Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable (The analog logic remains off and consumes no power.)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP_STOP_EN</name>
              <description>Comparator STANDBY Mode Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the analog comparator regardless of CMP_EN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Allow the analog comparator to be enabled by CMP_EN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINKEN</name>
              <description>CMP-to-DAC Link Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the CMP-to-DAC link: enabling or disabling the DAC is independent from enabling or disabling the CMP.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the CMP-to-DAC link: the DAC enable/disable is controlled by the CMP_EN bit instead of DCR[DAC_EN]. Also, when the CMP is auto-disabled because software selects the same signal for both the plus and minus comparator inputs, the DAC is disabled too.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>Comparator Control Register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WINDOW_EN</name>
              <description>Windowing Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE_EN</name>
              <description>Sampling Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_EN</name>
              <description>DMA Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COUT_INV</name>
              <description>Comparator Invert</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_INVERT</name>
                  <description>Do not invert</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>Invert</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COUT_SEL</name>
              <description>Comparator Output Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COUT</name>
                  <description>Use COUT (filtered)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUTA</name>
                  <description>Use COUTA (unfiltered)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COUT_PEN</name>
              <description>Comparator Output Pin Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNAVAILABLE</name>
                  <description>Not available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVAILABLE</name>
                  <description>Available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COUTA_OWEN</name>
              <description>COUTA_OW Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMPLED</name>
                  <description>COUTA holds the last sampled value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUTA_OW</name>
                  <description>COUTA is defined by the COUTA_OW bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COUTA_OW</name>
              <description>COUTA Output Level for Closed Window</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COUTA_0</name>
                  <description>COUTA is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUTA_1</name>
                  <description>COUTA is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINDOW_INV</name>
              <description>WINDOW/SAMPLE Signal Invert</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_INVERT</name>
                  <description>Do not invert</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>Invert</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINDOW_CLS</name>
              <description>CMPO Event Window Close</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOSE</name>
                  <description>CMPO event cannot close the window</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOSE</name>
                  <description>CMPO event can close the window</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVT_SEL</name>
              <description>CMPO Event Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILT_CNT</name>
              <description>Filter Sample Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASSED</name>
                  <description>Filter is bypassed: COUT = COUTA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_1</name>
                  <description>1 consecutive sample (Comparator output is simply sampled.)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_2</name>
                  <description>2 consecutive samples</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_3</name>
                  <description>3 consecutive samples</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_4</name>
                  <description>4 consecutive samples</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_5</name>
                  <description>5 consecutive samples</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_6</name>
                  <description>6 consecutive samples</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_7</name>
                  <description>7 consecutive samples</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILT_PER</name>
              <description>Filter Sample Period</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
