DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FCCU</name>
      <description>FCCU</description>
      <groupName>FCCU</groupName>
      <baseAddress>0x40384000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x13C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FCCU_0</name>
        <value>189</value>
      </interrupt>
      <interrupt>
        <name>FCCU_1</name>
        <value>190</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPR</name>
              <description>Operation Run</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPS</name>
              <description>Operation Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>In progress</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>Aborted</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>Successful</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG</name>
              <description>Debug Mode Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLK</name>
          <description>Control Key</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTRLK</name>
              <description>Locked-Operation Control Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Configuration</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FOM</name>
              <description>Fault-Output (EOUT) Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id010</name>
                  <description>Bi-Stable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id101</name>
                  <description>Test 0 (controlled by the EINOUT register; EOUT1 is an output; EOUT0 is an input)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id110</name>
                  <description>Test 1 (controlled by the EINOUT register; EOUT1 and EOUT0 are both outputs)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id</name>
                  <description>Test 2 (controlled by the EINOUT register; EOUT1 is an input; EOUT0 is an output)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PS</name>
              <description>Fault-Output (EOUT) Polarity Selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>For the faulty indication, EOUT1 is high, and EOUT0 is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>For the faulty indication, EOUT1 is low, and EOUT0 is high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>Fault-Output (EOUT) Configuration-Indication Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Different</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Same</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_SET_CLEAR</name>
              <description>Fault-Output (EOUT) Control</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>Controlled by the FSM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>Always low</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>Controlled by the FSM</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>High until a fault occurs on a channel, regardless of whether that fault is disabled; thereafter, controlled by the FSM. Note: FCCU ignores an attempt to write this value if the fault-output (EOUT) timer is already running.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_SET_AFTER_RESET</name>
              <description>Fault-Output (EOUT) Activate</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Inactive (the EOUT signals are in a high-impedance state)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Active (the EOUT signals indicate FCCU's condition)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NCF_CFG0</name>
          <description>Non-critical Fault Configuration</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NCFC0</name>
              <description>Non-critical Fault Configuration n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Hardware-recoverable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Software-recoverable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFC1</name>
              <description>Non-critical Fault Configuration n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Hardware-recoverable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Software-recoverable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFC2</name>
              <description>Non-critical Fault Configuration n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Hardware-recoverable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Software-recoverable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFC3</name>
              <description>Non-critical Fault Configuration n</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Hardware-recoverable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Software-recoverable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFC4</name>
              <description>Non-critical Fault Configuration n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Hardware-recoverable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Software-recoverable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFC5</name>
              <description>Non-critical Fault Configuration n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Hardware-recoverable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Software-recoverable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFC6</name>
              <description>Non-critical Fault Configuration n</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Hardware-recoverable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Software-recoverable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFC7</name>
              <description>Non-critical Fault Configuration n</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Hardware-recoverable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Software-recoverable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NCFS_CFG0</name>
          <description>Non-critical Fault-State Configuration</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NCFSC0</name>
              <description>Non-critical Fault-State Configuration n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>Enabled (rst_sfunc_b) (short)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>Disabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFSC1</name>
              <description>Non-critical Fault-State Configuration n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>Enabled (rst_sfunc_b) (short)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>Disabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFSC2</name>
              <description>Non-critical Fault-State Configuration n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>Enabled (rst_sfunc_b) (short)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>Disabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFSC3</name>
              <description>Non-critical Fault-State Configuration n</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>Enabled (rst_sfunc_b) (short)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>Disabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFSC4</name>
              <description>Non-critical Fault-State Configuration n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>Enabled (rst_sfunc_b) (short)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>Disabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFSC5</name>
              <description>Non-critical Fault-State Configuration n</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>Enabled (rst_sfunc_b) (short)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>Disabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFSC6</name>
              <description>Non-critical Fault-State Configuration n</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>Enabled (rst_sfunc_b) (short)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>Disabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCFSC7</name>
              <description>Non-critical Fault-State Configuration n</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>Enabled (rst_sfunc_b) (short)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>Disabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
