DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/BaseNXP_TS_T40D34M70I1R0/header/S32K344_M7.svd
        <register>
          <name>LUT17</name>
          <description>LUT Register</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPRND0</name>
              <description>Operand for INSTR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD0</name>
              <description>Pad information for INSTR0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR0</name>
              <description>Instruction 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPRND1</name>
              <description>Operand for INSTR1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD1</name>
              <description>Pad information for INSTR1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR1</name>
              <description>Instruction 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT18</name>
          <description>LUT Register</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPRND0</name>
              <description>Operand for INSTR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD0</name>
              <description>Pad information for INSTR0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR0</name>
              <description>Instruction 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPRND1</name>
              <description>Operand for INSTR1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD1</name>
              <description>Pad information for INSTR1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR1</name>
              <description>Instruction 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT19</name>
          <description>LUT Register</description>
          <addressOffset>0x35C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPRND0</name>
              <description>Operand for INSTR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD0</name>
              <description>Pad information for INSTR0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR0</name>
              <description>Instruction 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPRND1</name>
              <description>Operand for INSTR1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD1</name>
              <description>Pad information for INSTR1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR1</name>
              <description>Instruction 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
